---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModuleIterator.Dispose
source: html/29386eec-7a2f-0ade-434b-ab6cf3463031.htm
---
# Autodesk.Revit.DB.Macros.MacroModuleIterator.Dispose Method

Releases all resources used by the MacroModuleIterator

## Syntax (C#)
```csharp
public void Dispose()
```